# Rest

In [3]:
%LOAD data/example.db

In [4]:
SELECT *
FROM sqlite_schema;

+-------+-------------+-------------+----------+----------------------------------------------------+
| type  | name        | tbl_name    | rootpage | sql                                                |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | countries   | countries   | 3        | CREATE TABLE `countries` (                         |
|       |             |             |          | `country_id` TEXT NOT NULL DEFAULT '',             |
|       |             |             |          | `country_name` TEXT DEFAULT NULL,                  |
|       |             |             |          | `region_id` INT DEFAULT NULL                       |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | departments | departments | 4        | CREATE TABLE `departments` (                       |
|       |             |             |          | `department_id` INT NOT NULL DEFAULT '0',          |
|       |             |             |          | `department_name` TEXT DEFAULT NULL,               |
|       |             |             |          | `manager_id` INT DEFAULT NULL,                     |
|       |             |             |          | `location_id` INT DEFAULT NULL                     |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | employees   | employees   | 5        | CREATE TABLE `employees` (                         |
|       |             |             |          | `employee_id` INT NOT NULL DEFAULT '0',            |
|       |             |             |          | `first_name` TEXT DEFAULT NULL,                    |
|       |             |             |          | `last_name` TEXT DEFAULT NULL,                     |
|       |             |             |          | `email` TEXT DEFAULT NULL,                         |
|       |             |             |          | `phone_number` TEXT DEFAULT NULL,                  |
|       |             |             |          | `hire_date` date DEFAULT NULL,                     |
|       |             |             |          | `job_id` TEXT DEFAULT NULL,                        |
|       |             |             |          | `salary` NUMERIC DEFAULT NULL,                     |
|       |             |             |          | `commission_pct` NUMERIC DEFAULT NULL,             |
|       |             |             |          | `manager_id` INT DEFAULT NULL,                     |
|       |             |             |          | `department_id` INT DEFAULT NULL,                  |
|       |             |             |          | `bonus` TEXT DEFAULT NULL                          |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | jobs        | jobs        | 6        | CREATE TABLE `jobs` (                              |
|       |             |             |          | `job_id` TEXT NOT NULL DEFAULT '',                 |
|       |             |             |          | `job_title` TEXT DEFAULT NULL,                     |
|       |             |             |          | `min_salary` INT DEFAULT NULL,                     |
|       |             |             |          | `max_salary` INT DEFAULT NULL                      |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | job_grades  | job_grades  | 7        | CREATE TABLE `job_grades` (                        |
|       |             |             |          | `grade_level` TEXT DEFAULT NULL,                   |
|       |             |             |          | `lowest_sal` INT DEFAULT NULL,                     |
|       |             |             |          | `highest_sal` INT DEFAULT NULL                     |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | job_history | job_history | 8        | CREATE TABLE `job_history` (                       |
|       |             |             |          | `employee_id` INT NOT NULL DEFAULT '0',            |
|       |             |             |          | `start_date` TEXT NOT NULL DEFAULT '0000-00-00',   |
|       |             |             |          | `end_date` TEXT NOT NULL DEFAULT '0000-00-00',     |
|       |             |             |          | `job_id` TEXT NOT NULL,                            |
|       |             |             |          | `department_id` INT NOT NULL                       |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | locations   | locations   | 9        | CREATE TABLE `locations` (                         |
|       |             |             |          | `location_id` INT NOT NULL DEFAULT '0',            |
|       |             |             |          | `street_address` TEXT DEFAULT NULL,                |
|       |             |             |          | `postal_code` TEXT DEFAULT NULL,                   |
|       |             |             |          | `city` TEXT DEFAULT NULL,                          |
|       |             |             |          | `state_province` TEXT DEFAULT NULL,                |
|       |             |             |          | `country_id` TEXT DEFAULT NULL                     |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+
| table | regions     | regions     | 2        | CREATE TABLE `regions` (                           |
|       |             |             |          | `region_id` INT NOT NULL DEFAULT '0',              |
|       |             |             |          | `region_name` TEXT DEFAULT NULL                    |
|       |             |             |          | )                                                  |
+-------+-------------+-------------+----------+----------------------------------------------------+

In [5]:
SELECT sql
FROM sqlite_schema
WHERE name = 'departments';

+---------------------------------------------+
| sql                                         |
+---------------------------------------------+
| CREATE TABLE `departments` (                |
| `department_id` INT NOT NULL DEFAULT '0',   |
| `department_name` TEXT DEFAULT NULL,        |
| `manager_id` INT DEFAULT NULL,              |
| `location_id` INT DEFAULT NULL              |
| )                                           |
+---------------------------------------------+

Je ziet hier de namen en types van de kolommen.
De kolom `department_id` heeft `INT` waarden en mag niet `NULL` (leeg) zijn.
(De reden daarvoor is dat dit de primary key is. Maar dat hebben we in de definitie van de tabel nog niet opgegeven.)

## Concat

In [6]:
SELECT concat('Hans', 'van', 'Dijk');

Error: no such function: concat

In [8]:
SELECT 'Hans' || ' van ' || 'Dijk';

+-----------------------------+
| 'Hans' || ' van ' || 'Dijk' |
+-----------------------------+
| Hans van Dijk               |
+-----------------------------+